In [1]:
import warnings
warnings.filterwarnings('ignore')
from IPython.display import Image
import numpy as np
import pandas as pd

판다스 데이터프레임과 시리즈  
데이터프레임과 시리즈는 딕셔너리와 비슷하지만 데이터를 다루는데 더 특화되어 있다.  
리스트와 딕셔너리는 많은 양의 데이터를 저장하거나 데이터를 조작할 수 있는 메소드가 많지 않은 반면에 판다스는 데이터프레임과 시리즈는 많은 양을 저장할 수 있을 뿐만 아니라 스프레드시트 프로그램을 사용하는 것 처럼 행과 열 단위로 원하는 데이터를 조작할 수 있는 다양한 속성과 메소드를 제공한다.

시리즈 만들기

In [2]:
s = pd.Series(['banana', 42])
print(type(s))
print(s)

<class 'pandas.core.series.Series'>
0    banana
1        42
dtype: object

In [3]:
s = pd.Series(['Wes MaKinney', 'Creator of Pandas'])
print(s)
# 시리즈를 생성할 때 문자열을 인덱스로 지정할 수도 있다.
# 문자열을 인덱스로 지정하려면 Series() 메소드의 index 속성으로 인덱스로 사용하고자 하는 문자열을 리스트에 담아서 전달하면
# 된다.
s = pd.Series(['Wes MaKinney', 'Creator of Pandas'], index=['Person', 'Who'])
print(s)

0         Wes MaKinney
1    Creator of Pandas
dtype: object
Person         Wes MaKinney
Who       Creator of Pandas
dtype: object

데이터프레임 만들기

In [4]:
# 데이터프레임을 만들기 위해서는 딕셔너리를 DateFrame() 메소드의 인수로 전달해야 한다.
scientists = pd.DataFrame({
    # 'key': [value, value, ...] # key가 데이터프레임의 열 이름이 되고 value는 데이터가 된다.
    'Name': ['Rosaline Ftanklin', 'William Sealy Gosset'],
    'Occupation': ['Chemist', 'Statistcian'],
    'Born': ['1920-04-20', '1875-06-10'],
    'Died': ['1957-08-20', '1930-12-10'],
    'Age': [37, 60]
})
print(type(scientists))
scientists

<class 'pandas.core.frame.DataFrame'>

                   Name   Occupation        Born        Died  Age
0     Rosaline Ftanklin      Chemist  1920-04-20  1957-08-20   37
1  William Sealy Gosset  Statistcian  1875-06-10  1930-12-10   60

In [5]:
# DataFrame() 메소드의 data 속성으로 데이터를 지정하고 index 속성으로 인덱스를 columns 속성으로 열 이름을 지정할 수 있다.
scientists = pd.DataFrame(
    data={
        'Occupation': ['Chemist', 'Statistcian'],
        'Born': ['1920-04-20', '1875-06-10'],
        'Died': ['1957-08-20', '1930-12-10'],
        'Age': [37, 60]
    },
    index=['Rosaline Ftanklin', 'William Sealy Gosset'],
    columns=['Occupation', 'Born', 'Died', 'Age']
)
print(type(scientists))
scientists

<class 'pandas.core.frame.DataFrame'>

                       Occupation        Born        Died  Age
Rosaline Ftanklin         Chemist  1920-04-20  1957-08-20   37
William Sealy Gosset  Statistcian  1875-06-10  1930-12-10   60

In [6]:
# 딕셔너리는 키와 값으로 이루어진 한 쌍의 데이터로 입력되는 데이터들의 순서를 보장하지 않는다.
# 순서가 보장되는 딕셔너리를 전달하려면 collections 모듈을 import 하고 OrderedDict() 함수를 사용하면 데이터의 순서를 그대로
# 유지하면서 데이터프레임을 만들 수 있다.
# OrderedDict() 함수의 인수는 (key, value) 형태의 튜플을 인수로 전달하고 value는 리스트 형태로 전달한다.
from collections import OrderedDict
scientists = pd.DataFrame(
    OrderedDict([
        ('Name', ['Rosaline Ftanklin', 'William Sealy Gosset']),
        ('Occupation', ['Chemist', 'Statistcian']),
        ('Born', ['1920-04-20', '1875-06-10']),
        ('Died', ['1957-08-20', '1930-12-10']),
        ('Age', [37, 60])
    ])
)
print(type(scientists))
scientists

<class 'pandas.core.frame.DataFrame'>

                   Name   Occupation        Born        Died  Age
0     Rosaline Ftanklin      Chemist  1920-04-20  1957-08-20   37
1  William Sealy Gosset  Statistcian  1875-06-10  1930-12-10   60

시리즈 다루기

In [7]:
scientists = pd.DataFrame(
    data={
        'Occupation': ['Chemist', 'Statistcian'],
        'Born': ['1920-04-20', '1875-06-10'],
        'Died': ['1957-08-20', '1930-12-10'],
        'Age': [37, 60]
    },
    index=['Rosaline Ftanklin', 'William Sealy Gosset'],
    columns=['Occupation', 'Born', 'Died', 'Age']
)
scientists

                       Occupation        Born        Died  Age
Rosaline Ftanklin         Chemist  1920-04-20  1957-08-20   37
William Sealy Gosset  Statistcian  1875-06-10  1930-12-10   60

In [8]:
# 데이터프레임에서 시리즈를 선택하려면 loc 속성에 인덱스를 전달하면 된다. => 인덱스는 문자열도 가능하다.
row = scientists.loc['William Sealy Gosset']
print(type(row))
row

<class 'pandas.core.series.Series'>

Occupation    Statistcian
Born           1875-06-10
Died           1930-12-10
Age                    60
Name: William Sealy Gosset, dtype: object

index, values 속성과 keys() 메소드

In [9]:
# index 속성은 시리즈의 인덱스를 얻어온다.
print(type(row.index))
print(row.index)
# values 속성은 시리즈의 데이터를 얻어온다.
print(type(row.values))
print(row.values)
# keys() 메소드는 index 속성과 같이 시리즈의 인덱스를 얻어온다.
print(type(row.keys()))
print(row.keys())
# index 속성의 첫 번째 값 추출하기
print(type(row.index[0]))
print(row.index[0])
print(type(row.keys()[0]))
print(row.keys()[0])
# values 속성의 첫 번째 값 추출하기
print(type(row.values[0]))
print(row.values[0])

<class 'pandas.core.indexes.base.Index'>
Index(['Occupation', 'Born', 'Died', 'Age'], dtype='object')
<class 'numpy.ndarray'>
['Statistcian' '1875-06-10' '1930-12-10' 60]
<class 'pandas.core.indexes.base.Index'>
Index(['Occupation', 'Born', 'Died', 'Age'], dtype='object')
<class 'str'>
Occupation
<class 'str'>
Occupation
<class 'str'>
Statistcian

시리즈 기초 통계 메소드

In [10]:
ages = scientists['Age']
print(type(ages))
print(ages)

print('max = {}'.format(ages.max()))
print('min = {}'.format(ages.min()))
print('sum = {}'.format(ages.sum()))
print('mean = {}'.format(ages.mean()))
print('std = {}'.format(ages.std()))

<class 'pandas.core.series.Series'>
Rosaline Ftanklin       37
William Sealy Gosset    60
Name: Age, dtype: int64
max = 60
min = 37
sum = 97
mean = 48.5
std = 16.263455967290593

In [11]:
scientists = pd.read_csv('./data/scientists.csv')
print(type(scientists))
scientists

<class 'pandas.core.frame.DataFrame'>

                   Name        Born        Died  Age          Occupation
0     Rosaline Franklin  1920-07-25  1958-04-16   37             Chemist
1        William Gosset  1876-06-13  1937-10-16   61        Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90               Nurse
3           Marie Curie  1867-11-07  1934-07-04   66             Chemist
4         Rachel Carson  1907-05-27  1964-04-14   56           Biologist
5             John Snow  1813-03-15  1858-06-16   45           Physician
6           Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist
7          Johann Gauss  1777-04-30  1855-02-23   77       Mathematician

In [12]:
ages = scientists['Age']
print(type(ages))
print(ages)

print('max = {}'.format(ages.max()))
print('min = {}'.format(ages.min()))
print('sum = {}'.format(ages.sum()))
print('mean = {}'.format(ages.mean()))
print('std = {}'.format(ages.std()))

<class 'pandas.core.series.Series'>
0    37
1    61
2    90
3    66
4    56
5    45
6    41
7    77
Name: Age, dtype: int64
max = 90
min = 37
sum = 473
mean = 59.125
std = 18.325918413937288

In [13]:
# 평균 나이보다 나이가 많은 사람의 데이터를 추출한다.
print(ages[ages > ages.mean()])

1    61
2    90
3    66
7    77
Name: Age, dtype: int64

In [14]:
print(ages > ages.mean())
bool_value = ages > ages.mean()
print(bool_value)
print(ages[bool_value])

0    False
1     True
2     True
3     True
4    False
5    False
6    False
7     True
Name: Age, dtype: bool
0    False
1     True
2     True
3     True
4    False
5    False
6    False
7     True
Name: Age, dtype: bool
1    61
2    90
3    66
7    77
Name: Age, dtype: int64

브로드캐스팅  
ages > ages.mean()와 같이 시리즈나 데이터프레임의 모든 데이터에 대해 한 번에 연산하는 것을 브로드캐스팅이라 한다.  
여러 개의 값을 가진 데이터를 벡터라 하고 단순 크기를 나타내는 데이터를 스칼라라 부른다.

In [15]:
for age in ages:
    print('{0:4d}'.format(age), end = ' ')
print()
# 같은 길이의 벡터로 연산을 하면 결과값으로 같은 길이의 벡터가 출력된다.
for age in ages + ages:
    print('{0:4d}'.format(age), end = ' ')
print()
for age in ages * ages:
    print('{0:4d}'.format(age), end = ' ')
print()
# 벡터에 스칼라 값을 연산하면 벡터 각각의 값에 스칼라 값이 연산된 결과가 출력된다.
for age in ages + 100:
    print('{0:4d}'.format(age), end = ' ')
print()
for age in ages * 2:
    print('{0:4d}'.format(age), end = ' ')

  37   61   90   66   56   45   41   77
  74  122  180  132  112   90   82  154
1369 3721 8100 4356 3136 2025 1681 5929
 137  161  190  166  156  145  141  177
  74  122  180  132  112   90   82  154

In [16]:
print(pd.Series([1, 100]))
# 길이가 서로 다른 벡터를 연산하면 같은 인덱스를 가지는 값만 계산된다.
# pd.Series([1, 100])의 0, 1 인덱스만 계산되고 나머지는 계산될 수 없으므로 누락값(NaN, 결측치)으로 처리한다.
print(ages + pd.Series([1, 100]))

0      1
1    100
dtype: int64
0     38.0
1    161.0
2      NaN
3      NaN
4      NaN
5      NaN
6      NaN
7      NaN
dtype: float64

In [17]:
print(ages)
# sort_index() 메소드는 데이터를 정렬하는 것이 아니고 인덱스를 정렬한다.
# ascending=False 옵션을 지정하면 내림차순으로 정럴한다. 기본값은 True 이다.
rev_ages = ages.sort_index(ascending=False)
print(rev_ages)
# 데이터를 정렬하려면 sort_values() 메소드를 사용한다.
rev_ages = ages.sort_values(ascending=False)
print(rev_ages)

0    37
1    61
2    90
3    66
4    56
5    45
6    41
7    77
Name: Age, dtype: int64
7    77
6    41
5    45
4    56
3    66
2    90
1    61
0    37
Name: Age, dtype: int64
2    90
7    77
3    66
1    61
4    56
5    45
6    41
0    37
Name: Age, dtype: int64

In [18]:
rev_ages = ages.sort_index(ascending=False)
print(rev_ages)
# 벡터와 벡터의 연산은 같은 인덱스를 가지는 값끼리 수행하기 때문에 ages + rev_ages와 ages * 2는 같은 결과가 계산된다.
for age in ages + rev_ages:
    print('{0:4d}'.format(age), end = ' ')
print()
for age in ages * 2:
    print('{0:4d}'.format(age), end = ' ')

7    77
6    41
5    45
4    56
3    66
2    90
1    61
0    37
Name: Age, dtype: int64
  74  122  180  132  112   90   82  154
  74  122  180  132  112   90   82  154

데이터프레임도 시리즈와 마찬가지로 불린 인덱싱과 브로드캐스팅을 할 수 있다.

In [19]:
print(scientists)
print('=' * 80)
print(scientists[scientists['Age'] > scientists['Age'].mean()])

                   Name        Born        Died  Age          Occupation
0     Rosaline Franklin  1920-07-25  1958-04-16   37             Chemist
1        William Gosset  1876-06-13  1937-10-16   61        Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90               Nurse
3           Marie Curie  1867-11-07  1934-07-04   66             Chemist
4         Rachel Carson  1907-05-27  1964-04-14   56           Biologist
5             John Snow  1813-03-15  1858-06-16   45           Physician
6           Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist
7          Johann Gauss  1777-04-30  1855-02-23   77       Mathematician
================================================================================
                   Name        Born        Died  Age     Occupation
1        William Gosset  1876-06-13  1937-10-16   61   Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90          Nurse
3           Marie Curie  1867-11-07  1934-07-04   66        Chemist
7          Johann Gauss  1777-04-30  1855-02-23   77  Mathematician

In [20]:
# 시리즈에 스칼라 연산을 적용할 때 모든 요소에 스칼라를 적용해서 연산이 실행된 것 처럼 데이터프레임도 마찬가지로 
# 데이터프레임에 2를 곱하면 문자열 데이터는 문자열이 2회 반복되고 숫자 데이터는 2를 곱한 숫자가 된다.
print(scientists * 2)

                                       Name                  Born  \
0        Rosaline FranklinRosaline Franklin  1920-07-251920-07-25
1              William GossetWilliam Gosset  1876-06-131876-06-13
2  Florence NightingaleFlorence Nightingale  1820-05-121820-05-12
3                    Marie CurieMarie Curie  1867-11-071867-11-07
4                Rachel CarsonRachel Carson  1907-05-271907-05-27
5                        John SnowJohn Snow  1813-03-151813-03-15
6                    Alan TuringAlan Turing  1912-06-231912-06-23
7                  Johann GaussJohann Gauss  1777-04-301777-04-30

                   Died  Age                            Occupation
0  1958-04-161958-04-16   74                        ChemistChemist
1  1937-10-161937-10-16  122              StatisticianStatistician
2  1910-08-131910-08-13  180                            NurseNurse
3  1934-07-041934-07-04  132                        ChemistChemist
4  1964-04-141964-04-14  112                    BiologistBiologist
5  1858-06-161858-06-16   90                    PhysicianPhysician
6  1954-06-071954-06-07   82  Computer ScientistComputer Scientist
7  1855-02-231855-02-23  154            MathematicianMathematician

데이터프레임 열의 자료형 바꾸기

In [21]:
scientists = pd.read_csv('./data/scientists.csv')
scientists

                   Name        Born        Died  Age          Occupation
0     Rosaline Franklin  1920-07-25  1958-04-16   37             Chemist
1        William Gosset  1876-06-13  1937-10-16   61        Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90               Nurse
3           Marie Curie  1867-11-07  1934-07-04   66             Chemist
4         Rachel Carson  1907-05-27  1964-04-14   56           Biologist
5             John Snow  1813-03-15  1858-06-16   45           Physician
6           Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist
7          Johann Gauss  1777-04-30  1855-02-23   77       Mathematician

In [22]:
# dtype 속성을 사용하면 시리즈에 저장된 데이터 타입을 얻어올 수 있다.
print(type(scientists['Born']))
print(scientists['Born'].dtype) # object => 파이썬의 문자열(str)은 판다스에서는 object 타입이 된다.
print(scientists['Died'].dtype)

<class 'pandas.core.series.Series'>
object
object

In [23]:
# 날짜를 문자열로 저장한 데이터는 날짜 및 시간 관련 작업을 할 수 있도록 to_datetime() 메소드로 datetime 자료형으로 바꿔주는
# 것이 좋다.
# to_datetime(시리즈, format='날짜서식')
# %Y => 년도 4자리, %y => 년도 2자리, %m => 월(숫자), %B => 월(영어, 전체), %b(%h) => 월(영어, 3글자), %d => 일
# %A => 요일(전체), %a => 요일(3글자), %H => 시간(24시각), %I => 시간(12시각), %M => 분, %S => 초, %p => AM/PM
# %f => 마이크로 초
born_datetime = pd.to_datetime(scientists['Born'], format='%Y-%m-%d')
print(born_datetime)
died_datetime = pd.to_datetime(scientists['Died'], format='%Y-%m-%d')
print(died_datetime)

0   1920-07-25
1   1876-06-13
2   1820-05-12
3   1867-11-07
4   1907-05-27
5   1813-03-15
6   1912-06-23
7   1777-04-30
Name: Born, dtype: datetime64[ns]
0   1958-04-16
1   1937-10-16
2   1910-08-13
3   1934-07-04
4   1964-04-14
5   1858-06-16
6   1954-06-07
7   1855-02-23
Name: Died, dtype: datetime64[ns]

In [24]:
# datetime 타입으로 변경한 born_datetime, died_datetime를 데이터프레임에 추가한다.
print(scientists.shape)
# 데이터프레임['추가할 열 이름'] = 추가할 데이터
scientists['born_dt'], scientists['died_dt'] = born_datetime, died_datetime
print(scientists.shape)
scientists

(8, 5)
(8, 7)

,Name,Born,Died,Age,Occupation,born_dt,died_dt
0,Rosaline Franklin,1920-07-25,1958-04-16,37,Chemist,1920-07-25,1958-04-16
1,William Gosset,1876-06-13,1937-10-16,61,Statistician,1876-06-13,1937-10-16
2,Florence Nightingale,1820-05-12,1910-08-13,90,Nurse,1820-05-12,1910-08-13
3,Marie Curie,1867-11-07,1934-07-04,66,Chemist,1867-11-07,1934-07-04
4,Rachel Carson,1907-05-27,1964-04-14,56,Biologist,1907-05-27,1964-04-14
5,John Snow,1813-03-15,1858-06-16,45,Physician,1813-03-15,1858-06-16
6,Alan Turing,1912-06-23,1954-06-07,41,Computer Scientist,1912-06-23,1954-06-07
7,Johann Gauss,1777-04-30,1855-02-23,77,Mathematician,1777-04-30,1855-02-23

In [25]:
# scientists['age_days_dt'] = scientists['Died'] - scientists['Born'] # 에러
# 추가한 파생변수 scientists['died_dt']에서 scientists['born_dt']를 빼면 얼마동안 세상을 살다 떠났는지 계산할 수 있다.
scientists['age_days_dt'] = scientists['died_dt'] - scientists['born_dt']
print(scientists.shape)
scientists

(8, 8)

,Name,Born,Died,Age,Occupation,born_dt,died_dt,age_days_dt
0,Rosaline Franklin,1920-07-25,1958-04-16,37,Chemist,1920-07-25,1958-04-16,13779 days
1,William Gosset,1876-06-13,1937-10-16,61,Statistician,1876-06-13,1937-10-16,22404 days
2,Florence Nightingale,1820-05-12,1910-08-13,90,Nurse,1820-05-12,1910-08-13,32964 days
3,Marie Curie,1867-11-07,1934-07-04,66,Chemist,1867-11-07,1934-07-04,24345 days
4,Rachel Carson,1907-05-27,1964-04-14,56,Biologist,1907-05-27,1964-04-14,20777 days
5,John Snow,1813-03-15,1858-06-16,45,Physician,1813-03-15,1858-06-16,16529 days
6,Alan Turing,1912-06-23,1954-06-07,41,Computer Scientist,1912-06-23,1954-06-07,15324 days
7,Johann Gauss,1777-04-30,1855-02-23,77,Mathematician,1777-04-30,1855-02-23,28422 days

시리즈, 데이터프레임의 열 섞기

In [26]:
import random as r
# shuffle() 메소드의 데이터를 무작위로 섞어준다.
r.shuffle(scientists['Age']) # scientists 데이터프레임의 Age 열만 섞인다.
scientists

,Name,Born,Died,Age,Occupation,born_dt,died_dt,age_days_dt
0,Rosaline Franklin,1920-07-25,1958-04-16,56,Chemist,1920-07-25,1958-04-16,13779 days
1,William Gosset,1876-06-13,1937-10-16,77,Statistician,1876-06-13,1937-10-16,22404 days
2,Florence Nightingale,1820-05-12,1910-08-13,45,Nurse,1820-05-12,1910-08-13,32964 days
3,Marie Curie,1867-11-07,1934-07-04,90,Chemist,1867-11-07,1934-07-04,24345 days
4,Rachel Carson,1907-05-27,1964-04-14,41,Biologist,1907-05-27,1964-04-14,20777 days
5,John Snow,1813-03-15,1858-06-16,66,Physician,1813-03-15,1858-06-16,16529 days
6,Alan Turing,1912-06-23,1954-06-07,61,Computer Scientist,1912-06-23,1954-06-07,15324 days
7,Johann Gauss,1777-04-30,1855-02-23,37,Mathematician,1777-04-30,1855-02-23,28422 days

데이터프레임 열 삭제하기

In [27]:
scientists = pd.read_csv('./data/scientists.csv')
scientists

                   Name        Born        Died  Age          Occupation
0     Rosaline Franklin  1920-07-25  1958-04-16   37             Chemist
1        William Gosset  1876-06-13  1937-10-16   61        Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90               Nurse
3           Marie Curie  1867-11-07  1934-07-04   66             Chemist
4         Rachel Carson  1907-05-27  1964-04-14   56           Biologist
5             John Snow  1813-03-15  1858-06-16   45           Physician
6           Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist
7          Johann Gauss  1777-04-30  1855-02-23   77       Mathematician

In [28]:
# drop() 메소드는 데이터프레임의 열을 삭제한다.
# drop([삭제할 열 이름], axis=1), 삭제할 열이 2개 이상일 경우 리스트에 넣어줘야 한다.
# drop() 메소드는 axis=0이 기본값이고 axis=0으로 지정하면 행을 제거하려 하기 때문에 에러가 발생되므로 반드시 axis=1를
# 사용해야 한다.
scientists_dropped = scientists.drop(['Age', 'Occupation'], axis=1)
scientists_dropped

                   Name        Born        Died
0     Rosaline Franklin  1920-07-25  1958-04-16
1        William Gosset  1876-06-13  1937-10-16
2  Florence Nightingale  1820-05-12  1910-08-13
3           Marie Curie  1867-11-07  1934-07-04
4         Rachel Carson  1907-05-27  1964-04-14
5             John Snow  1813-03-15  1858-06-16
6           Alan Turing  1912-06-23  1954-06-07
7          Johann Gauss  1777-04-30  1855-02-23

데이터를 피클, CSV, TSV 파일로 저장하고 불러오기

In [29]:
names = scientists['Name']
print(names)
# 피클은 데이터를 바이너리 형태로 직렬화한 오브젝트를 저장하는 방법으로 데이터를 오래 보관한다는 뜻으로 피클이라는 이름이
# 붙여진 것이다.
# 피클로 저장하면 스프레드시트보다 더 작은 용량으로 데이터를 저장할 수 잇어 편리하다.
# 시리즈를 피클로 저장하려면 to_pickle() 메소드를 사용한다.
names.to_pickle('./output/scientists_name_series.pickle')

# 피클은 바이너리 형태의 오브젝트이기 때문에 저장된 피클을 데이터 편집기와 같은 프로그램에서 열어보면 이상한 문자가 나타난다.
# 피클을 읽어오려면 read_pickle() 메소드를 사용한다.
scientists_names_from_pickle = pd.read_pickle('./output/scientists_name_series.pickle')
print(scientists_names_from_pickle)

0       Rosaline Franklin
1          William Gosset
2    Florence Nightingale
3             Marie Curie
4           Rachel Carson
5               John Snow
6             Alan Turing
7            Johann Gauss
Name: Name, dtype: object
0       Rosaline Franklin
1          William Gosset
2    Florence Nightingale
3             Marie Curie
4           Rachel Carson
5               John Snow
6             Alan Turing
7            Johann Gauss
Name: Name, dtype: object

In [30]:
# 데이터프레임도 피클로 저장할 수 있다.
scientists.to_pickle('./output/scientists_df.pickle')
scientists_from_pickle = pd.read_pickle('./output/scientists_df.pickle')
scientists_from_pickle

                   Name        Born        Died  Age          Occupation
0     Rosaline Franklin  1920-07-25  1958-04-16   37             Chemist
1        William Gosset  1876-06-13  1937-10-16   61        Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90               Nurse
3           Marie Curie  1867-11-07  1934-07-04   66             Chemist
4         Rachel Carson  1907-05-27  1964-04-14   56           Biologist
5             John Snow  1813-03-15  1858-06-16   45           Physician
6           Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist
7          Johann Gauss  1777-04-30  1855-02-23   77       Mathematician

In [31]:
# to_csv() 메소드로 시리즈와 데이터프레임을 csv 파일로 저장할 수 있다.
# sep 속성에 '\t'를 지정하면 tsv 파일로 저장할 수 있다.
names.to_csv('./output/scientists_name_series.csv')
scientists.to_csv('./output/scientists_df.tsv', sep='\t')